#+title: Participants in NFDI4BIOIMAGE
#+author: @CFGrote
#+date: [2025-03-26 Wed] 
#+property: header-args:sparql :url https://query.wikidata.org/sparql :noweb yes :cache no :results replace
#+property: header-args:python :noweb yes :cache yes :results replace :async yes

** Prototype a query that attempts to find a wikidata item for a given name (fullname)
:PROPERTIES:
:ID:       1b535a07-8a01-4c5e-969a-ee8f67283fde
:END:
#+name: all_names
#+begin_src sparql
  <<prefixes>>
  select distinct ?item ?lbl where {
    ?item wdt:P31 wd:Q5 .
    ?item rdfs:label ?lbl .

    values ?lbl {
      "Carsten Fortmann-Grote"@de
      "Carsten Fortmann-Grote"@en
      "Tobias Gottschall"@de
      "Tobias Gottschall"@en
      "Markus Blank-Burian"@de
      "Markus Blank-Burian"@en
      "Marc-Thilo Figge"@de
      "Marc-Thilo Figge"@en
      "Björn Grüning"@de
      "Björn Grüning"@en
      "Robert Haase"@de
      "Robert Haase"@en
      "Anna Kreshuk"@de
      "Anna Kreshuk"@en
      "Susanne Kunis"@de
      "Susanne Kunis"@en
      "Jan-Philipp Mallm"@de
      "Jan-Philipp Mallm"@en
      "Elisa May"@de
      "Elisa May"@en
      "Josh Moore"@de
      "Josh Moore"@en
      "Thomas Zobel"@de
      "Thomas Zobel"@en
      "Janina Hanne"@de
      "Janina Hanne"@en
      "Markus Becker"@de
      "Markus Becker"@en
      "Thomas Bocklitz"@de
      "Thomas Bocklitz"@en
      "Jan Bumberger"@de
      "Jan Bumberger"@en
      "Claire Chalopin"@de
      "Claire Chalopin"@en
      "Jianxu Chen"@de
      "Jianxu Chen"@en
      "Paul Czodrowski"@de
      "Paul Czodrowski"@en
      "Timo Dickscheid"@de
      "Timo Dickscheid"@en
      "Carsten Fortmann-Grote"@de
      "Carsten Fortmann-Grote"@en
      "Jan Huisken"@de
      "Jan Huisken"@en
      "Matthias Landwehr"@de
      "Matthias Landwehr"@en
      "Jan Lohmann"@de
      "Jan Lohmann"@en
      "Astrid Schauss"@de
      "Astrid Schauss"@en
      "Michael Schlierf"@de
      "Michael Schlierf"@en
      "Peter Zentis"@de
      "Peter Zentis"@en
      "Andrea Leibfried"@de
      "Andrea Leibfried"@en
      "Juliane Jäger"@de
      "Juliane Jäger"@en
      "Riccardo Massei"@de
      "Riccardo Massei"@en
      "Mohsen Ahmadi"@de
      "Mohsen Ahmadi"@en
      "Vanessa Fuchs"@de
      "Vanessa Fuchs"@en
      "Ksenia Kroos"@de
      "Ksenia Kroos"@en
      "Maximilan Müller"@de
      "Maximilan Müller"@en
      "Jens Wendt"@de
      "Jens Wendt"@en
      "Cornelia Wetzker"@de
      "Cornelia Wetzker"@en
      "Niraj Kandpal"@de
      "Niraj Kandpal"@en
      "Marie Balennius"@de
      "Marie Balennius"@en
      "Inga Mohr"@de
      "Inga Mohr"@en
      "Lucy Sonnet"@de
      "Lucy Sonnet"@en
      "Julia Thönnißen"@de
      "Julia Thönnißen"@en
      "Ami Trivedi"@de
      "Ami Trivedi"@en
      "Robert Wagner"@de
      "Robert Wagner"@en
      "Michele Bortolomeazzi"@de
      "Michele Bortolomeazzi"@en
      "Rodrigo Escobar Díaz Guerrero"@de
      "Rodrigo Escobar Díaz Guerrero"@en
      "Ruman Gerst"@de
      "Ruman Gerst"@en
      "Tobias Gottschall"@de
      "Tobias Gottschall"@en
      "Haowen Jiang"@de
      "Haowen Jiang"@en
      "Yi Sun"@de
      "Yi Sun"@en
      "Michael Scherle"@de
      "Michael Scherle"@en
    }
    }
  order by ?lbl
#+end_src

#+RESULTS[e9c5823237b655086205982667a5de58e05e1672]: all_names
| item                                      | lbl                    |
|-------------------------------------------+------------------------|
| http://www.wikidata.org/entity/Q4746097   | Ami Trivedi            |
| http://www.wikidata.org/entity/Q115556246 | Astrid Schauss         |
| http://www.wikidata.org/entity/Q40615839  | Björn Grüning          |
| http://www.wikidata.org/entity/Q89164423  | Carsten Fortmann-Grote |
| http://www.wikidata.org/entity/Q43198948  | Jan Huisken            |
| http://www.wikidata.org/entity/Q109650151 | Jan Lohmann            |
| http://www.wikidata.org/entity/Q115556609 | Jianxu Chen            |
| http://www.wikidata.org/entity/Q1720279   | Markus Becker          |
| http://www.wikidata.org/entity/Q1901378   | Markus Becker          |
| http://www.wikidata.org/entity/Q1901380   | Markus Becker          |
| http://www.wikidata.org/entity/Q1901384   | Markus Becker          |
| http://www.wikidata.org/entity/Q60053770  | Markus Becker          |
| http://www.wikidata.org/entity/Q60169509  | Markus Becker          |
| http://www.wikidata.org/entity/Q95770325  | Markus Becker          |
| http://www.wikidata.org/entity/Q95770331  | Markus Becker          |
| http://www.wikidata.org/entity/Q115556282 | Markus Becker          |
| http://www.wikidata.org/entity/Q1929218   | Michael Schlierf       |
| http://www.wikidata.org/entity/Q47687016  | Michael Schlierf       |
| http://www.wikidata.org/entity/Q133300650 | Niraj Kandpal          |
| http://www.wikidata.org/entity/Q7345138   | Robert Haase           |
| http://www.wikidata.org/entity/Q128238736 | Robert Haase           |
| http://www.wikidata.org/entity/Q71604     | Robert Wagner          |
| http://www.wikidata.org/entity/Q310493    | Robert Wagner          |
| http://www.wikidata.org/entity/Q471707    | Robert Wagner          |
| http://www.wikidata.org/entity/Q698868    | Robert Wagner          |
| http://www.wikidata.org/entity/Q2920078   | Robert Wagner          |
| http://www.wikidata.org/entity/Q3436518   | Robert Wagner          |
| http://www.wikidata.org/entity/Q4102226   | Robert Wagner          |
| http://www.wikidata.org/entity/Q18710901  | Robert Wagner          |
| http://www.wikidata.org/entity/Q94850688  | Robert Wagner          |
| http://www.wikidata.org/entity/Q94879011  | Robert Wagner          |
| http://www.wikidata.org/entity/Q94882361  | Robert Wagner          |
| http://www.wikidata.org/entity/Q95238276  | Robert Wagner          |
| http://www.wikidata.org/entity/Q95250954  | Robert Wagner          |
| http://www.wikidata.org/entity/Q108101413 | Robert Wagner          |
| http://www.wikidata.org/entity/Q109238765 | Robert Wagner          |
| http://www.wikidata.org/entity/Q112447015 | Robert Wagner          |
| http://www.wikidata.org/entity/Q130469711 | Robert Wagner          |
| http://www.wikidata.org/entity/Q130778839 | Robert Wagner          |
| http://www.wikidata.org/entity/Q133538116 | Tobias Gottschall      |
| http://www.wikidata.org/entity/Q20011325  | Vanessa Fuchs          |
| http://www.wikidata.org/entity/Q33694887  | Yi Sun                 |
| http://www.wikidata.org/entity/Q48304805  | Yi Sun                 |
| http://www.wikidata.org/entity/Q4746097   | Ami Trivedi            |
| http://www.wikidata.org/entity/Q80671621  | Andrea Leibfried       |
| http://www.wikidata.org/entity/Q67207690  | Anna Kreshuk           |
| http://www.wikidata.org/entity/Q115556246 | Astrid Schauss         |
| http://www.wikidata.org/entity/Q89164423  | Carsten Fortmann-Grote |
| http://www.wikidata.org/entity/Q115556311 | Claire Chalopin        |
| http://www.wikidata.org/entity/Q90216755  | Haowen Jiang           |
| http://www.wikidata.org/entity/Q90917187  | Haowen Jiang           |
| http://www.wikidata.org/entity/Q92744574  | Haowen Jiang           |
| http://www.wikidata.org/entity/Q96276864  | Haowen Jiang           |
| http://www.wikidata.org/entity/Q56754796  | Jan Bumberger          |
| http://www.wikidata.org/entity/Q43198948  | Jan Huisken            |
| http://www.wikidata.org/entity/Q11718275  | Jan Lohmann            |
| http://www.wikidata.org/entity/Q109650151 | Jan Lohmann            |
| http://www.wikidata.org/entity/Q91106544  | Jan-Philipp Mallm      |
| http://www.wikidata.org/entity/Q59436369  | Janina Hanne           |
| http://www.wikidata.org/entity/Q132290679 | Jens Wendt             |
| http://www.wikidata.org/entity/Q115556609 | Jianxu Chen            |
| http://www.wikidata.org/entity/Q22006998  | Josh Moore             |
| http://www.wikidata.org/entity/Q56512375  | Josh Moore             |
| http://www.wikidata.org/entity/Q115245304 | Josh Moore             |
| http://www.wikidata.org/entity/Q1720279   | Markus Becker          |
| http://www.wikidata.org/entity/Q1901378   | Markus Becker          |
| http://www.wikidata.org/entity/Q1901380   | Markus Becker          |
| http://www.wikidata.org/entity/Q1901384   | Markus Becker          |
| http://www.wikidata.org/entity/Q60053770  | Markus Becker          |
| http://www.wikidata.org/entity/Q60169509  | Markus Becker          |
| http://www.wikidata.org/entity/Q89369158  | Markus Becker          |
| http://www.wikidata.org/entity/Q95770325  | Markus Becker          |
| http://www.wikidata.org/entity/Q95770331  | Markus Becker          |
| http://www.wikidata.org/entity/Q99075453  | Markus Becker          |
| http://www.wikidata.org/entity/Q99394073  | Markus Becker          |
| http://www.wikidata.org/entity/Q102301285 | Markus Becker          |
| http://www.wikidata.org/entity/Q115556282 | Markus Becker          |
| http://www.wikidata.org/entity/Q1929218   | Michael Schlierf       |
| http://www.wikidata.org/entity/Q47687016  | Michael Schlierf       |
| http://www.wikidata.org/entity/Q5911001   | Mohsen Ahmadi          |
| http://www.wikidata.org/entity/Q59698915  | Mohsen Ahmadi          |
| http://www.wikidata.org/entity/Q91349605  | Mohsen Ahmadi          |
| http://www.wikidata.org/entity/Q93133769  | Mohsen Ahmadi          |
| http://www.wikidata.org/entity/Q110805258 | Mohsen Ahmadi          |
| http://www.wikidata.org/entity/Q133300650 | Niraj Kandpal          |
| http://www.wikidata.org/entity/Q56112063  | Paul Czodrowski        |
| http://www.wikidata.org/entity/Q92562642  | Peter Zentis           |
| http://www.wikidata.org/entity/Q89924709  | Riccardo Massei        |
| http://www.wikidata.org/entity/Q7345138   | Robert Haase           |
| http://www.wikidata.org/entity/Q56107317  | Robert Haase           |
| http://www.wikidata.org/entity/Q128238736 | Robert Haase           |
| http://www.wikidata.org/entity/Q310493    | Robert Wagner          |
| http://www.wikidata.org/entity/Q471707    | Robert Wagner          |
| http://www.wikidata.org/entity/Q698868    | Robert Wagner          |
| http://www.wikidata.org/entity/Q2920078   | Robert Wagner          |
| http://www.wikidata.org/entity/Q3436518   | Robert Wagner          |
| http://www.wikidata.org/entity/Q4102226   | Robert Wagner          |
| http://www.wikidata.org/entity/Q18710901  | Robert Wagner          |
| http://www.wikidata.org/entity/Q37382596  | Robert Wagner          |
| http://www.wikidata.org/entity/Q43139753  | Robert Wagner          |
| http://www.wikidata.org/entity/Q86425320  | Robert Wagner          |
| http://www.wikidata.org/entity/Q86753939  | Robert Wagner          |
| http://www.wikidata.org/entity/Q94850688  | Robert Wagner          |
| http://www.wikidata.org/entity/Q94879011  | Robert Wagner          |
| http://www.wikidata.org/entity/Q94882361  | Robert Wagner          |
| http://www.wikidata.org/entity/Q95238276  | Robert Wagner          |
| http://www.wikidata.org/entity/Q95250954  | Robert Wagner          |
| http://www.wikidata.org/entity/Q102364675 | Robert Wagner          |
| http://www.wikidata.org/entity/Q108101413 | Robert Wagner          |
| http://www.wikidata.org/entity/Q109238765 | Robert Wagner          |
| http://www.wikidata.org/entity/Q112406408 | Robert Wagner          |
| http://www.wikidata.org/entity/Q112447015 | Robert Wagner          |
| http://www.wikidata.org/entity/Q130267416 | Robert Wagner          |
| http://www.wikidata.org/entity/Q130469711 | Robert Wagner          |
| http://www.wikidata.org/entity/Q130778839 | Robert Wagner          |
| http://www.wikidata.org/entity/Q48367863  | Thomas Bocklitz        |
| http://www.wikidata.org/entity/Q40172376  | Thomas Zobel           |
| http://www.wikidata.org/entity/Q91533391  | Timo Dickscheid        |
| http://www.wikidata.org/entity/Q133538116 | Tobias Gottschall      |
| http://www.wikidata.org/entity/Q20011325  | Vanessa Fuchs          |
| http://www.wikidata.org/entity/Q33694887  | Yi Sun                 |
| http://www.wikidata.org/entity/Q48304805  | Yi Sun                 |
| http://www.wikidata.org/entity/Q57983130  | Yi Sun                 |
| http://www.wikidata.org/entity/Q58806734  | Yi Sun                 |
| http://www.wikidata.org/entity/Q58808626  | Yi Sun                 |
| http://www.wikidata.org/entity/Q61862141  | Yi Sun                 |
| http://www.wikidata.org/entity/Q86527013  | Yi Sun                 |
| http://www.wikidata.org/entity/Q87004252  | Yi Sun                 |
| http://www.wikidata.org/entity/Q87582824  | Yi Sun                 |
| http://www.wikidata.org/entity/Q87663173  | Yi Sun                 |
| http://www.wikidata.org/entity/Q87716739  | Yi Sun                 |
| http://www.wikidata.org/entity/Q88925530  | Yi Sun                 |
| http://www.wikidata.org/entity/Q89137286  | Yi Sun                 |
| http://www.wikidata.org/entity/Q90138465  | Yi Sun                 |
| http://www.wikidata.org/entity/Q90751165  | Yi Sun                 |
| http://www.wikidata.org/entity/Q91435316  | Yi Sun                 |
| http://www.wikidata.org/entity/Q91488203  | Yi Sun                 |
| http://www.wikidata.org/entity/Q91519912  | Yi Sun                 |
| http://www.wikidata.org/entity/Q91520417  | Yi Sun                 |
| http://www.wikidata.org/entity/Q92139822  | Yi Sun                 |
| http://www.wikidata.org/entity/Q92164845  | Yi Sun                 |
| http://www.wikidata.org/entity/Q92810044  | Yi Sun                 |
| http://www.wikidata.org/entity/Q92886580  | Yi Sun                 |
| http://www.wikidata.org/entity/Q93205063  | Yi Sun                 |
| http://www.wikidata.org/entity/Q93337698  | Yi Sun                 |
| http://www.wikidata.org/entity/Q95967093  | Yi Sun                 |
| http://www.wikidata.org/entity/Q96187116  | Yi Sun                 |
| http://www.wikidata.org/entity/Q96205808  | Yi Sun                 |
| http://www.wikidata.org/entity/Q98204782  | Yi Sun                 |
| http://www.wikidata.org/entity/Q100381560 | Yi Sun                 |
| http://www.wikidata.org/entity/Q101120730 | Yi Sun                 |
| http://www.wikidata.org/entity/Q102143854 | Yi Sun                 |
| http://www.wikidata.org/entity/Q102301666 | Yi Sun                 |
| http://www.wikidata.org/entity/Q102328793 | Yi Sun                 |
| http://www.wikidata.org/entity/Q102390286 | Yi Sun                 |
| http://www.wikidata.org/entity/Q102457077 | Yi Sun                 |
| http://www.wikidata.org/entity/Q102876446 | Yi Sun                 |
| http://www.wikidata.org/entity/Q121289211 | Yi Sun                 |
| http://www.wikidata.org/entity/Q125821431 | Yi Sun                 |
| http://www.wikidata.org/entity/Q130841593 | Yi Sun                 |
| http://www.wikidata.org/entity/Q130870908 | Yi Sun                 |
| http://www.wikidata.org/entity/Q130883175 | Yi Sun                 |
| http://www.wikidata.org/entity/Q130914679 | Yi Sun                 |
| http://www.wikidata.org/entity/Q130967997 | Yi Sun                 |
| http://www.wikidata.org/entity/Q131197890 | Yi Sun                 |

Ok, this works. We'll now code up a python function to run this query on wikidata and return the =?item= value or =None=.

#+name: pywikiperson
#+begin_src python
  // Imports
  <<pywikipersons.imports>>

  // function run_query()

  // 

#+end_src

** NFDI4BI participants
:PROPERTIES:
:ID:       e6123b3a-9373-4675-81e7-3b9548066918
:END:
#+begin_src sparql
   <<prefixes>>
   select ?item ?itemLabel where {
     ?item wdt:P31 wd:Q5;
           ^wdt:P710 wd:Q113500855 .
     SERVICE wikibase:label { bd:serviceParam wikibase:language "en". }

     values ?item {
  wd:Q109650151     
  wd:Q115556246
  wd:Q115556282
  wd:Q115556311
  wd:Q115556609
  wd:Q132290679
  wd:Q133300650
  wd:Q133538116
  wd:Q40172376
  wd:Q40615839
  wd:Q43198948
  wd:Q4746097
  wd:Q47687016
  wd:Q48367863
  wd:Q56107317
  wd:Q56112063
  wd:Q56512375
  wd:Q56754796
  wd:Q67207690
  wd:Q80671621
  wd:Q89164423
  wd:Q89924709
  wd:Q9021675
  wd:Q9091718
  wd:Q91106544
  wd:Q91349605
  wd:Q91533391      
  wd:Q92562642      
  wd:Q9274457     
  wd:Q9627686   
       }
     }
#+end_src

#+RESULTS[16f482b0f80f87fe5367d3b2121f87cc39faee6f]:
| item                                      | itemLabel              |
|-------------------------------------------+------------------------|
| http://www.wikidata.org/entity/Q43198948  | Jan Huisken            |
| http://www.wikidata.org/entity/Q48367863  | Thomas Bocklitz        |
| http://www.wikidata.org/entity/Q56112063  | Paul Czodrowski        |
| http://www.wikidata.org/entity/Q56512375  | Josh Moore             |
| http://www.wikidata.org/entity/Q56754796  | Jan Bumberger          |
| http://www.wikidata.org/entity/Q89164423  | Carsten Fortmann-Grote |
| http://www.wikidata.org/entity/Q91533391  | Timo Dickscheid        |
| http://www.wikidata.org/entity/Q115556246 | Astrid Schauss         |
| http://www.wikidata.org/entity/Q115556282 | Markus Becker          |
| http://www.wikidata.org/entity/Q115556311 | Claire Chalopin        |
| http://www.wikidata.org/entity/Q115556609 | Jianxu Chen            |
| http://www.wikidata.org/entity/Q133300650 | Niraj Kandpal          |
| http://www.wikidata.org/entity/Q133538116 | Tobias Gottschall      |
